" Vimrc 配置
set softtabstop=4
set expandtab
set smarttab
set tabstop=4       " 设置tab键的宽度
set backspace=2     " 设置退格键可用
set nu!             " 显示行号
set filetype=c
set wildmenu
set wrap           " 自动换行
set linebreak       " 整词换行
set whichwrap=b,s,<,>,[,]       " 光标从行首和行末时可以跳到另一行去
set autochdir                   " 自动设置目录为正在编辑的文件所在的目录
set fencs=utf-8,gbk
"--------------------------------------------------------------------------------
" 查找/替换相关的设置 "--------------------------------------------------------------------------------
set hlsearch        " 高亮显示搜索结果,:nohl取消高亮
set incsearch       " 搜索中匹配
 "--------------------------------------------------------------------------------
" 状态栏相关的设置 "--------------------------------------------------------------------------------
set statusline=[%F]%y%r%m%*%=[Line:%l/%L,Column:%c][%p%%]
set laststatus=2    " always show the status line
set ruler           " 在编辑过程中，在右下角显示光标位置的状态行 "--------------------------------------------------------------------------------
" 编程相关的设置 "--------------------------------------------------------------------------------
set completeopt=longest,menu    " 关掉智能补全时的预览窗口
filetype pluginindenton       " 加了这句才可以用智能补全
syn on              " 打开语法高亮
set showmatch       " 设置匹配模式，类似当输入一个左括号时会匹配相应的那个右括号
set smartindent     " 智能对齐方式
set shiftwidth=4    " 换行时行间交错使用4个空格
set autoindent      " 自动对齐
set ai!             " 设置自动缩进
  "--------------------------------------------------------------------------------
" 模仿MS Windows中的快捷键 "--------------------------------------------------------------------------------
vmap <C-c> "yy
vmap <C-x> "yd
nmap <C-v> "yp
vmap <C-v> "yp
nmap <C-a> ggvG$
imap <C-s> <Esc>:wa<cr>i<Right>
nmap <C-s> :wa<cr>


"#############################################################################
" 插件设置
"#############################################################################

"---------------------------------------------------------------------------
"ctags 设置：
"---------------------------------------------------------------------------
"CTRL-F12快捷键自动生成tags目录
"CTRL-] 跳转到光标所在符号的定义
"Ctrl-t 回到上次跳转前的位置
set tags=tags;
set autochdir
map <C-F12> :!ctags -R --c++-kinds=+p --fields=+iaS --extra=+q .<CR>
 

"---------------------------------------------------------------------------
"Taglist 设置:
"---------------------------------------------------------------------------
let Tlist_Auto_Open = 1
let Tlist_Ctags_Cmd = '/usr/bin/ctags'
let Tlist_Show_One_File=1
let Tlist_Exit_OnlyWindow=1


"---------------------------------------------------------------------------
"WinManager设置
"---------------------------------------------------------------------------
let g:winManagerWindowLayout='FileExplorer'
nmap wm :WMToggle<cr>
